In [1]:
import pandas as pd
pd.set_option('display.max_colwidth', None)  # No truncation for column values
pd.set_option('display.expand_frame_repr', False)

In [15]:
user_data = pd.read_csv('../New Files/cleaned_user_data.csv')

In [ ]:
user_lookup = user_data[['old_id','user_id','name']].copy()
user_lookup.rename(columns={'user_id':'new_id'},inplace=True)
user_lookup

In [39]:
user_job = pd.read_csv('../../../Raw Dataset/Customer Management Department/user_job.csv')
user_job

      Unnamed: 0    user_id              name       job_title   job_level
0              0  USER40678        Zion Feest      Technician    Accounts
1              1  USER08728  Kattie Bergstrom      Technician   Solutions
2              2  USER29759      Aiden Corwin         Student         NaN
3              3  USER16806    Vince Gislason         Student         NaN
4              4  USER27644     Adele Okuneva       Associate   Usability
...          ...        ...               ...             ...         ...
4995        4995  USER49969   Kendall Waelchi     Facilitator  Directives
4996        4996  USER57209  Lucious Kshlerin         Student         NaN
4997        4997  USER36424    Cordie Jenkins  Representative  Directives
4998        4998  USER45166        Tyrel Feil      Supervisor     Metrics
4999        4999  USER54154       Betty Zieme         Student         NaN

[5000 rows x 5 columns]

In [ ]:
updated_user_job = user_job.merge(
    user_lookup[['old_id','new_id','name']],
    left_on=['user_id','name'],
    right_on=['old_id','name'],
    how='left'
)

updated_user_job['user_id'] = updated_user_job['new_id']
updated_user_job = updated_user_job.sort_values(by='user_id')

In [42]:
updated_user_job = updated_user_job.drop(columns=['new_id','old_id'])
updated_user_job

      Unnamed: 0    user_id                name  job_title      job_level
2547        2547  USER00001     Melisa Jacobson   Director        Program
4483        4483  USER00002   Garfield Reynolds  Developer  Configuration
3533        3533  USER00003      Amos Marquardt    Student            NaN
1633        1633  USER00004   Brendan Halvorson  Assistant      Usability
3248        3248  USER00005         Gerda Bauch    Manager   Interactions
...          ...        ...                 ...        ...            ...
880          880  USER04996     Rickie Johnston  Assistant            Web
1408        1408  USER04997  Fabiola Swaniawski  Assistant      Marketing
1393        1393  USER04998         Bria Reilly   Designer   Optimization
629          629  USER04999           Alex Dare    Officer     Operations
107          107  USER05000    Mohamed McKenzie    Analyst        Markets

[5000 rows x 5 columns]

In [ ]:
updated_user_job['job_level'] = updated_user_job['job_level'].fillna('N/A')

In [45]:
updated_user_job = updated_user_job.drop(updated_user_job.columns[0], axis=1)
updated_user_job

        user_id                name  job_title      job_level
2547  USER00001     Melisa Jacobson   Director        Program
4483  USER00002   Garfield Reynolds  Developer  Configuration
3533  USER00003      Amos Marquardt    Student            N/A
1633  USER00004   Brendan Halvorson  Assistant      Usability
3248  USER00005         Gerda Bauch    Manager   Interactions
...         ...                 ...        ...            ...
880   USER04996     Rickie Johnston  Assistant            Web
1408  USER04997  Fabiola Swaniawski  Assistant      Marketing
1393  USER04998         Bria Reilly   Designer   Optimization
629   USER04999           Alex Dare    Officer     Operations
107   USER05000    Mohamed McKenzie    Analyst        Markets

[5000 rows x 4 columns]

In [46]:
nulls = updated_user_job.isnull().sum()
print("Null values in each column: ")
print(nulls)

Null values in each column:
user_id      0
name         0
job_title    0
job_level    0
dtype: int64